Revit 2026 API

# IFCExtrusionCalculatorUtils Methods

---

The IFCExtrusionCalculatorUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CalculateExtrusionData(IFCExtrusionCalculatorOptions, GeometryObject) | Calculates the extrusion data from a Revit geometry object. |
|  | CalculateExtrusionData(IFCExtrusionCalculatorOptions, IListFace) |  |

#### Reference

IFCExtrusionCalculatorUtils Class

Autodesk.Revit.DB.IFC Namespace